{"events":[
{"message": "I had sex with a guy in the men's bathroom in Dwinelle, Floor C and then again the next week in the bathrooms on the GWS floor in Barrows. I would go in a stall and wait for him to knock twice on the stall door. He had great facial hair and wore a blue Patagonia jacket. I never got his name. ", "lat": 37.870433, "long": -122.260323},
{"message": "I had sex with a guy in the men's bathroom in Dwinelle, Floor C and then again the next week in the bathrooms on the GWS floor in Barrows. I would go in a stall and wait for him to knock twice on the stall door. He had great facial hair and wore a blue Patagonia jacket. I never got his name. ", "lat": 37.870039, "long": -122.257984},
{"message": "Hot n heavy make out sesh", "lat": 37.876458, "long": -122.263455},
{"message": "He pulled down my pants in the Morrison Hall elevator and went to town! He was more familiar with the building than I was, so he convinced me that nobody uses it. I guess he was right, haha", "lat": 37.870881, "long": -122.256197},
{"message": "FPF Courtyard in the middle of the night, maybe 11PM. We were wandering around downtown not really knowing where we were headed, and then he pulled me into the middle of the courtyard and went down to a little corner. It was pretty exciting, he ate my ass, I fucked him, he came all over the concrete ground.", "lat": 37.864715, "long": -122.256101},
{"message": "Before my first day at Berkeley over last summer, I never expected to become a promiscuous person. As a horny freshman as I was, though, I downloaded Grindr and checked the happenings around campus. I was greeted with a message from a senior who was working on campus at the moment. At first I didn't expect the conversation to go anywhere, but as we talked, I decided to meet up. Surprisingly, he asked me to meet up on campus in a Lab in Stanley and added that a third person would be watching. I'm not sure why I still thought that was a good idea on my first date but I went through with it. In the end, I didn't regret it and actually became friends with benefits with the guy. ", "lat": 37.873943, "long": -122.256353},
{"message": "The first time I hooked up with a guy we had sex on campus. It was a gameday and I would go on to date this guy for over a year. I told him it was a fantasy of mine to have sex against the campanile and he was like let’s do it. So we tried to have sex In the tree area by the campanile but it was like 9pm on a night gameday so there were too many people. We then moved to these random tables by haviland Hall I think and had pretty dope table sex. Anyways, that’s the story of the first time I hooked up with my then boyfriend.", "lat": 37.87244, "long": -122.257973},
{"message": "A stressful dead week resulted in raunchy flirting with a study parter. We ended up sneaking into the women's bathroom in Moffitt and fucking against the bathroom stall door. I feel like all study buddies should double for this", "lat": 37.872516, "long": -122.260827},
{"message": "I slipped him some tongue, but I made have also slipped him something else if you know what I mean. ", "lat": 37.870568, "long": -122.257691},
{"message": "Got a blowjob in the Wheeler basement bathroom and used poppers for the first time.", "lat": 37.87111, "long": -122.259336}]}